# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
ll = ['a','b','c']
myList = [1,2,3]
arr = np.array([1,2,3])
dic = {'a':1,'b':2,'c':3}

In [3]:
ll

['a', 'b', 'c']

In [4]:
myList

[1, 2, 3]

In [5]:
arr

array([1, 2, 3])

In [6]:
dic

{'a': 1, 'b': 2, 'c': 3}

In [7]:
pd.Series(myList)

0    1
1    2
2    3
dtype: int64

In [8]:
pd.Series(myList , ll)

a    1
b    2
c    3
dtype: int64

In [9]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [10]:
pd.Series(arr,ll)

a    1
b    2
c    3
dtype: int32

In [11]:
pd.Series(dic)

a    1
b    2
c    3
dtype: int64

# access values

In [13]:
data = [1,2,3,4]
countries  = ['USA','Egypt','Japan','Germany']
ser1 = pd.Series(data,countries)
ser1

USA        1
Egypt      2
Japan      3
Germany    4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,5,4], index=['USA', 'Germany','Italy', 'Japan'])  
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [17]:
ser1['USA']

1

In [18]:
ser1['Egypt']

2

In [19]:
ser1 + ser2

Egypt      NaN
Germany    6.0
Italy      NaN
Japan      7.0
USA        2.0
dtype: float64

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

* 1) Creating DataFrames
* 2) Selecting, Creating and Dropping Columns
* 3) Selecting, Creating and Dropping Rows 
* 4) Selecting subset of rows and columns
* 5) Selecting by conditions
* 6) Selecting by data type
* 7) Set New Index
* 8) Reset Index

In [7]:
import pandas as pd
import numpy as np

np.random.seed(101)

# 1) Creating DataFrames
 Using Numpy Array

In [8]:
rand_number = np.random.randn(5,4)
rand_number

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [9]:
dataF = pd.DataFrame( rand_number, index=['a','b','c','d','e'] , columns=['w','x','y','z'])

In [10]:
dataF

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

Using Dictionary

In [11]:
dataF2 = pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6],
    'C':[7,8,9],
    'D':[10,20,33]
} , index= ['x','y','z'])
dataF2

   A  B  C   D
x  1  4  7  10
y  2  5  8  20
z  3  6  9  33

# 2) Selecting, Creating and Dropping Columns

In [12]:
dataF

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [13]:
dataF['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [14]:
dataF['z']

a    0.503826
b    0.605965
c   -0.589001
d    0.955057
e    0.683509
Name: z, dtype: float64

In [15]:
# select 2 columns 
dataF[['x','y']]

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077
c  0.740122  0.528813
d -0.758872 -0.933237
e  1.978757  2.605967

In [16]:
type(dataF['w'])

pandas.core.series.Series

In [50]:
# adding col to the matrix
dataF['new_col'] = [10,20,30,40,50]

In [17]:
dataF

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [18]:
dataF['my_np_array'] = np.array([200, 500, 800, 900, 700]) 
dataF

          w         x         y         z  my_np_array
a  2.706850  0.628133  0.907969  0.503826          200
b  0.651118 -0.319318 -0.848077  0.605965          500
c -2.018168  0.740122  0.528813 -0.589001          800
d  0.188695 -0.758872 -0.933237  0.955057          900
e  0.190794  1.978757  2.605967  0.683509          700

In [19]:
dataF['my_ser'] = pd.Series([100,200,300,400,500], index=['b', 'a', 'e', 'd', 'c'])
dataF

          w         x         y         z  my_np_array  my_ser
a  2.706850  0.628133  0.907969  0.503826          200     200
b  0.651118 -0.319318 -0.848077  0.605965          500     100
c -2.018168  0.740122  0.528813 -0.589001          800     500
d  0.188695 -0.758872 -0.933237  0.955057          900     400
e  0.190794  1.978757  2.605967  0.683509          700     300

In [20]:
dataF['new'] = dataF['w'] + dataF['y']
dataF

          w         x         y         z  my_np_array  my_ser       new
a  2.706850  0.628133  0.907969  0.503826          200     200  3.614819
b  0.651118 -0.319318 -0.848077  0.605965          500     100 -0.196959
c -2.018168  0.740122  0.528813 -0.589001          800     500 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057          900     400 -0.744542
e  0.190794  1.978757  2.605967  0.683509          700     300  2.796762

In [21]:
dataF['plus_5'] = dataF['my_ser'] + 5
dataF

,w,x,y,z,my_np_array,my_ser,new,plus_5
a,2.706850,0.628133,0.907969,0.503826,200,200,3.614819,205
b,0.651118,-0.319318,-0.848077,0.605965,500,100,-0.196959,105
c,-2.018168,0.740122,0.528813,-0.589001,800,500,-1.489355,505
d,0.188695,-0.758872,-0.933237,0.955057,900,400,-0.744542,405
e,0.190794,1.978757,2.605967,0.683509,700,300,2.796762,305

Droping Columns

In [22]:
dataF.drop('new' , axis=1)

          w         x         y         z  my_np_array  my_ser  plus_5
a  2.706850  0.628133  0.907969  0.503826          200     200     205
b  0.651118 -0.319318 -0.848077  0.605965          500     100     105
c -2.018168  0.740122  0.528813 -0.589001          800     500     505
d  0.188695 -0.758872 -0.933237  0.955057          900     400     405
e  0.190794  1.978757  2.605967  0.683509          700     300     305

In [23]:
dataF

,w,x,y,z,my_np_array,my_ser,new,plus_5
a,2.706850,0.628133,0.907969,0.503826,200,200,3.614819,205
b,0.651118,-0.319318,-0.848077,0.605965,500,100,-0.196959,105
c,-2.018168,0.740122,0.528813,-0.589001,800,500,-1.489355,505
d,0.188695,-0.758872,-0.933237,0.955057,900,400,-0.744542,405
e,0.190794,1.978757,2.605967,0.683509,700,300,2.796762,305

In [24]:
dataF.drop('new',axis=1 , inplace=True)
dataF

          w         x         y         z  my_np_array  my_ser  plus_5
a  2.706850  0.628133  0.907969  0.503826          200     200     205
b  0.651118 -0.319318 -0.848077  0.605965          500     100     105
c -2.018168  0.740122  0.528813 -0.589001          800     500     505
d  0.188695 -0.758872 -0.933237  0.955057          900     400     405
e  0.190794  1.978757  2.605967  0.683509          700     300     305

In [26]:
dataF.drop(columns=['my_np_array','my_ser','plus_5'],axis=1 , inplace=True)
dataF

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

# 3) Selecting , Creating and Dropping Rows
Selecting Rows

In [27]:
dataF

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [30]:
dataF.loc['a']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [31]:
dataF.loc['e']

w    0.190794
x    1.978757
y    2.605967
z    0.683509
Name: e, dtype: float64

Select Based off position instead of label

In [32]:
dataF.iloc[2]

w   -2.018168
x    0.740122
y    0.528813
z   -0.589001
Name: c, dtype: float64

In [34]:
dataF.iloc[3]

w    0.188695
x   -0.758872
y   -0.933237
z    0.955057
Name: d, dtype: float64

In [35]:
dataF.loc[['a','b']]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965

In [36]:
dataF.iloc[[0,1]]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965

In [37]:
dataF.iloc[2:5]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [38]:
dataF.loc['a']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [39]:
dataF.loc['a']['w']

2.706849839399938

In [40]:
dataF['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [41]:
dataF['w'].loc['a']

2.706849839399938

In [42]:
dataF

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

Creating new row

In [48]:
dataF.loc['f'] = [10,20,50,80]
dataF

           w          x          y          z
a   2.706850   0.628133   0.907969   0.503826
b   0.651118  -0.319318  -0.848077   0.605965
c  -2.018168   0.740122   0.528813  -0.589001
d   0.188695  -0.758872  -0.933237   0.955057
e   0.190794   1.978757   2.605967   0.683509
v  10.000000  20.000000  50.000000  80.000000
f  10.000000  20.000000  50.000000  80.000000

In [49]:
dataF.loc['h'] = dataF.loc['a'] + dataF.loc['b']
dataF

           w          x          y          z
a   2.706850   0.628133   0.907969   0.503826
b   0.651118  -0.319318  -0.848077   0.605965
c  -2.018168   0.740122   0.528813  -0.589001
d   0.188695  -0.758872  -0.933237   0.955057
e   0.190794   1.978757   2.605967   0.683509
v  10.000000  20.000000  50.000000  80.000000
f  10.000000  20.000000  50.000000  80.000000
h   3.357968   0.308815   0.059892   1.109791

In [52]:
dataF.drop('v',axis=0 , inplace=True)
dataF

           w          x          y          z
a   2.706850   0.628133   0.907969   0.503826
b   0.651118  -0.319318  -0.848077   0.605965
c  -2.018168   0.740122   0.528813  -0.589001
d   0.188695  -0.758872  -0.933237   0.955057
e   0.190794   1.978757   2.605967   0.683509
f  10.000000  20.000000  50.000000  80.000000
h   3.357968   0.308815   0.059892   1.109791

In [53]:
dataF.drop('h',axis=0,inplace=True)
dataF

           w          x          y          z
a   2.706850   0.628133   0.907969   0.503826
b   0.651118  -0.319318  -0.848077   0.605965
c  -2.018168   0.740122   0.528813  -0.589001
d   0.188695  -0.758872  -0.933237   0.955057
e   0.190794   1.978757   2.605967   0.683509
f  10.000000  20.000000  50.000000  80.000000

# 4) Selecting subset of rows and columns

In [54]:
dataF.loc['b']['y']

-0.8480769834036315

In [55]:
dataF.loc['b','y']

-0.8480769834036315

In [56]:
dataF.loc[['a','b'],['w','y']]

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077

In [58]:
dataF.loc[['a','b']][['w', 'y']]

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077

In [59]:
dataF[['w', 'x']].loc[['a','b']]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318

# 5) Selecting by conditions

In [60]:
dataF

           w          x          y          z
a   2.706850   0.628133   0.907969   0.503826
b   0.651118  -0.319318  -0.848077   0.605965
c  -2.018168   0.740122   0.528813  -0.589001
d   0.188695  -0.758872  -0.933237   0.955057
e   0.190794   1.978757   2.605967   0.683509
f  10.000000  20.000000  50.000000  80.000000

In [61]:
dataF > 0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True
f   True   True   True   True

In [62]:
dataF[dataF > 0]

           w          x          y          z
a   2.706850   0.628133   0.907969   0.503826
b   0.651118        NaN        NaN   0.605965
c        NaN   0.740122   0.528813        NaN
d   0.188695        NaN        NaN   0.955057
e   0.190794   1.978757   2.605967   0.683509
f  10.000000  20.000000  50.000000  80.000000

In [63]:
dataF['w'] > 0

a     True
b     True
c    False
d     True
e     True
f     True
Name: w, dtype: bool

In [64]:
dataF[dataF['w'] > 0]

           w          x          y          z
a   2.706850   0.628133   0.907969   0.503826
b   0.651118  -0.319318  -0.848077   0.605965
d   0.188695  -0.758872  -0.933237   0.955057
e   0.190794   1.978757   2.605967   0.683509
f  10.000000  20.000000  50.000000  80.000000

In [65]:
dataF[dataF['w'] > 0]['y']

a     0.907969
b    -0.848077
d    -0.933237
e     2.605967
f    50.000000
Name: y, dtype: float64

In [67]:
dataF[dataF['w'] > 0][['y','x']]

           y          x
a   0.907969   0.628133
b  -0.848077  -0.319318
d  -0.933237  -0.758872
e   2.605967   1.978757
f  50.000000  20.000000

For two conditions you can use | and & with parenthesis

In [69]:
(dataF['w'] > 0) & (dataF['y'] < 1)

a     True
b     True
c    False
d     True
e    False
f    False
dtype: bool

In [70]:
(dataF['w'] > 0) | (dataF['y'] < 1)

a    True
b    True
c    True
d    True
e    True
f    True
dtype: bool

# 6) Selecting by data type

In [72]:
df3 = pd.DataFrame(
    {
        "integers": pd.Series([1, 2, 3], dtype=np.dtype("int32")),
        "strings": pd.Series(["x", "y", "z"], dtype=np.dtype("O")),
        "booleans": pd.Series([True, False, np.nan], dtype=np.dtype("O")),
        "strings_2": pd.Series(["h", "i", np.nan], dtype=np.dtype("O")),
        "integers_2": pd.Series([10, np.nan, 20], dtype=np.dtype("float")),
        "floats": pd.Series([np.nan, 100.5, 200], dtype=np.dtype("float")),
        "dates": pd.Series(['30/7/1993 12:26:13', '30/7/1993 12:26:13', '30/7/1993 12:26:13'], dtype=np.dtype("O"))
    }
)

In [73]:
df3

   integers strings booleans strings_2  integers_2  floats               dates
0         1       x     True         h        10.0     NaN  30/7/1993 12:26:13
1         2       y    False         i         NaN   100.5  30/7/1993 12:26:13
2         3       z      NaN       NaN        20.0   200.0  30/7/1993 12:26:13

In [74]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   integers    3 non-null      int32
 1   strings     3 non-null      object
 2   booleans    2 non-null      object
 3   strings_2   2 non-null      object
 4   integers_2  2 non-null      float64
 5   floats      2 non-null      float64
 6   dates       3 non-null      object
dtypes: float64(2), int32(1), object(4)
memory usage: 288.0+ bytes

In [75]:
df3 = df3.convert_dtypes()
df3

,integers,strings,booleans,strings_2,integers_2,floats,dates
0,1,x,True,h,10,<NA>,30/7/1993 12:26:13
1,2,y,False,i,<NA>,100.5,30/7/1993 12:26:13
2,3,z,<NA>,<NA>,20,200.0,30/7/1993 12:26:13

In [76]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   integers    3 non-null      Int32
 1   strings     3 non-null      string
 2   booleans    2 non-null      boolean
 3   strings_2   2 non-null      string
 4   integers_2  2 non-null      Int64
 5   floats      2 non-null      Float64
 6   dates       3 non-null      string
dtypes: Float64(1), Int32(1), Int64(1), boolean(1), string(3)
memory usage: 279.0 bytes

In [77]:
df3['integers'] = df3['integers'].astype('float32')

In [78]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   integers    3 non-null      float32
 1   strings     3 non-null      string
 2   booleans    2 non-null      boolean
 3   strings_2   2 non-null      string
 4   integers_2  2 non-null      Int64
 5   floats      2 non-null      Float64
 6   dates       3 non-null      string
dtypes: Float64(1), Int64(1), boolean(1), float32(1), string(3)
memory usage: 276.0 bytes

In [79]:
df3['integers'] = df3['integers'].astype('int32')

In [80]:
df3

,integers,strings,booleans,strings_2,integers_2,floats,dates
0,1,x,True,h,10,<NA>,30/7/1993 12:26:13
1,2,y,False,i,<NA>,100.5,30/7/1993 12:26:13
2,3,z,<NA>,<NA>,20,200.0,30/7/1993 12:26:13

In [81]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   integers    3 non-null      int32
 1   strings     3 non-null      string
 2   booleans    2 non-null      boolean
 3   strings_2   2 non-null      string
 4   integers_2  2 non-null      Int64
 5   floats      2 non-null      Float64
 6   dates       3 non-null      string
dtypes: Float64(1), Int64(1), boolean(1), int32(1), string(3)
memory usage: 276.0 bytes

# Missing Data

In [82]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  'D': [10, np.nan, np.nan]})
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

check missing data existance

In [84]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False   True  False   True
2   True   True  False   True

In [85]:
df.isna().sum(axis=0)

A    1
B    2
C    0
D    2
dtype: int64

In [86]:
df.isna().sum(axis=1)

0    0
1    2
2    3
dtype: int64

droping the missing data

In [87]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [88]:
df.dropna(axis=0 , inplace= True)

In [89]:
df

     A    B  C     D
0  1.0  5.0  1  10.0

In [91]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  'D': [10, np.nan, np.nan]})

In [92]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [93]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [94]:
df.dropna(thresh=1, axis=0)

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [95]:
df.dropna(thresh=2)

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN

In [96]:
df.dropna(thresh=3)

     A    B  C     D
0  1.0  5.0  1  10.0

fill missing data

In [97]:
df.fillna(value=10)
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [98]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [99]:
df['A'].mean()

1.5

In [100]:
df['A'].fillna(value=df['A'].mean(), inplace=True)

In [101]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  1.5  NaN  3   NaN

In [102]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  'D': [10, np.nan, np.nan]})
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [103]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [104]:
for col in df.columns:
    df[col].fillna(value=df[col].mean(), inplace=True)
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  5.0  2  10.0
2  1.5  5.0  3  10.0

# Groupby

In [105]:

# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Sam','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Calls': [60,190,2,100,700,423]}

In [106]:
df = pd.DataFrame(data)
df

  Company   Person  Sales  Calls
0    GOOG      Sam    200     60
1    GOOG  Charlie    120    190
2    MSFT      Amy    340      2
3    MSFT  Vanessa    124    100
4      FB      Sam    243    700
5      FB    Sarah    350    423

In [115]:
# df.groupby('Calls').mean()

In [116]:
# df.groupby('Company').std()

In [117]:
# df

In [118]:
# df.groupby('Company').min()

In [119]:
s = pd.Series([1, 2, 3])
s.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
dtype: float64

In [120]:
s = pd.Series([1, 2, 3, 4, 5])
s.describe()

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

In [121]:
df.groupby('Company').describe()

        Sales                                                         Calls  \
        count   mean         std    min     25%    50%     75%    max count
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0   2.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0   2.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0   2.0


          mean         std    min     25%    50%     75%    max
Company
FB       561.5  195.868578  423.0  492.25  561.5  630.75  700.0
GOOG     125.0   91.923882   60.0   92.50  125.0  157.50  190.0
MSFT      51.0   69.296465    2.0   26.50   51.0   75.50  100.0

In [122]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000
Calls count    2.000000    2.000000    2.000000
      mean   561.500000  125.000000   51.000000
      std    195.868578   91.923882   69.296465
      min    423.000000   60.000000    2.000000
      25%    492.250000   92.500000   26.500000
      50%    561.500000  125.000000   51.000000
      75%    630.750000  157.500000   75.500000
      max    700.000000  190.000000  100.000000

In [123]:
df.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Calls  count      2.000000
       mean     125.000000
       std       91.923882
       min       60.000000
       25%       92.500000
       50%      125.000000
       75%      157.500000
       max      190.000000
Name: GOOG, dtype: float64

In [124]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [125]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [126]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [127]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

# Connection

In [129]:
new_df = pd.concat([df1 , df2] , axis=1)

In [130]:
new_df

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [131]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [132]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [133]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# Merging

In [134]:
pd.merge(left , right , how='inner' , on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [135]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [136]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [137]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [138]:
pd.merge(left,right,how='inner' , on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

# Joining

In [139]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [140]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [141]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [142]:
left.join(right, how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [143]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [144]:
left.join(right, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2